{
  "id": 219,
  "title": "The witnessed Jesus is the true Jesus. The Jesus of History is the man who will judge you, and the one who will judge every human being ever born.",
  "slug": "the-witnessed-jesus-is-the-true-jesus-the-jesus-of-history-is-the-man-who-will-judge-you-and-the-one",
  "author": "joshualinog",
  "createdAt": "2025-08-01T14:16:34Z",
  "updatedAt": "2025-11-07T21:13:18Z",
  "labels": [
    "why the Bible?",
    "the Bible as a tool",
    "boring Bible alien god",
    "🛐🕍⛪The EARLIEST Church",
    "💨🕊️🧔🏻‍♀️Yeshua =  THE SPIRIT enFLESHed Bodily Form",
    "Glory Name Face OF YAH / Visible | Earthly YAH",
    "isPost"
  ],
  "state": "open",
  "status": "published",
  "excerpt": "The historically witnessed human,  Jesus of Nazareth, is the Jesus who will judge you.",
  "content": "The historically witnessed human,  Jesus of Nazareth, is the Jesus who will judge you.\n\nEvery attempt to undo the incarnation will fail. Every person who seeks to wrest Jesus from Nazareth and rest him in role they have formed and shaped will fail. \n\nTHE WORD BECAME historically witnessed, Galilean accented, Y chromosomed, sleeping in a boat, covered and smothered by a crowd of Jews trying to touch his body. \n\nThis entourage of Jews still surrounds the Jesus that will judge you. He put them there. It was his plan as far back as Isaiah. He appointed them to be witnesses of the days of his flesh. with their own thoughts and pasts they reflected, recollected, and shared their testimony. Of this testimony from the crowd of Jews surrounding Jesus, a sliver was written down. \n\nThat's all we have for the witnessed Jesus.\n\nThat's all we have to access the Jesus of History. \n\nThe spirit of Jesus that will testify about himself to all who call in his name, \n\nWILL NEVER TAKE THE JOB AWAY FROM THESE JEWISH WITNESSES.\n\nThe Spirit of Jesus is Jesus. The Jesus who saw the young son of Zebedee, John, called him to be a witness of himself to the world. \n\nJesus will never silence the testimony of his witnesses. \n\nThe Spirit of Jesus will do miraculous manifestations of power and signs: HE WILL NEVER SPEAK OR ACT TO REPLACE THE TESTIMONY OF HIS WITNESSES, THE SCRIPTURES, THEIR WRITINGS ABOUT HIM. \n\nJesus of Nazareth appointed his own human witnesses of the days of his flesh. But what human witnesses were appointed for the days BEFORE his flesh?\n\nThe historical, Jesus of Nazareth, in his 30s, said all the Scriptures written witness to him. They are witnesses of Yeshua.\n\nJohn 5:39-40 LEB 39 You search the scriptures because you think that you have eternal life in them, and it is these that testify about me. 40 And you are not willing to come to me so that you may have life.\n\nNo encounter with the Spirit of Jesus will ever replace, nullify, or take the job of appointed witnesses testifying to Jesus.\n\nWe all must walk as that one walked. \n\nThe Spirit will show us how to walk like Jesus. \n\nThe Spirit of Jesus will NEVER replace the job of witnesses who witnessed Jesus of Nazareth walking on the Earth.\n\n\nBoth are REQUIRED to build his kingdom.\n\n\nThe Spirit of Jesus will show you how to do the commands of Jesus of Nazareth. \n\nThe Spirit of Jesus will never replace the witness writings of these commands stored in Scripture by his witnesses. The Spirit will NEVER tell you the commands John and Peter witnessed separate from John and Peter's own testimony, so as to replace what they witnessed.\n\n\n\n",
  "raw_issue": {
    "url": "https://github.com/joshualinog/scribal.bible-CONTENT-CREATION/issues/219",
    "number": 219
  }
}
