{
  "id": 221,
  "title": "Do we know our children's souls? Do we know our children's hearts? Have we reached our fill of knowing our children's souls? Have we reached our fill of knowing our children hearts?",
  "slug": "do-we-know-our-childrens-souls-do-we-know-our-childrens-hearts-have-we-reached-our-fill-of-knowing-o",
  "author": "joshualinog",
  "createdAt": "2025-08-03T20:14:39Z",
  "updatedAt": "2025-11-07T21:13:20Z",
  "labels": [
    "﹖.ᐣ❔🔎 🕵🏻 QUESTION",
    "➵𖦏TORAH - practicing  dry runs drills Playbook",
    "7️⃣ Word Seven | 7",
    "D6 - TORAH",
    "isPost"
  ],
  "state": "open",
  "status": "published",
  "excerpt": "- Do we know our children's souls? - Do we know our children's hearts?  - Have we reached our fill of knowing our children's souls?  - Have we reached our fill of knowing our children hearts? - does i",
  "content": "- Do we know our children's souls?\n- Do we know our children's hearts? \n- Have we reached our fill of knowing our children's souls? \n- Have we reached our fill of knowing our children hearts?\n- does it satisfy us to know our children's hearts? \n- does it satisfy us to know our children's souls? \n- can we teach the shema to our children if we don't know their soul? Can we teach them to love God with their soul if we don't know their soul? \n- can we teach the shema to our children if we don't know their heart? Can we teach them to love God with their heart if we don't know their heart?\n- how do we get past the present moment and whatever circumstances it has to find and gain access to our child's soul?\n- how do we get past the present moment and whatever circumstances of the present moment to find and gain access to our child's heart? \n- what is inside our child's heart? \n-  What is innately in our child's heart in terms of capacity and depth?\n- sometimes when we look in our child's heart we may find that there is not much seemingly accessible, because in some ways our child's heart is like a garden bed, and it can be empty if we do not seed their heart regularly and water it and grow it. Sometimes we can be terrified to see the tumbleweed and emptiness of our child's heart.\n- is it a wasted life to focus on knowing a child's heart? \n- is it a wasted life to become a master, and encyclopedia and cartographer of our child's soul? Is it a waste of time? \n- can we teach the shema to our child if we don't love our child in the teaching? Can we teach them to love God and the ACT of not - loving them as we teach?\n- how dull is the heart of our child when it is unsharpened to love God? \n- who is supposed to be the cartographer to chart and map the soul of our child? \n- who is supposed to be the cartographer to chart and map the heart of our child?\n- why are we not afraid of not knowing our child's heart? \n- why are we not afraid of knowing our child's soul? \n- why is it so easy to pass over trying to know further the soul of our child? \n- why is it so easy to pass over trying to know further the heart of our child?\n- Why is conversation and speech the vehicle for finding the heart and soul of our child? \n- how do we position ourselves to set our eyes and to set our ears on our child and to watch closely and to watch deeply in the hopes of getting a sighting of their soul? \n- how do we position ourselves to set our eyes and to set our ears on our child and to watch closely and to watch deeply in the hopes of getting a sighting of their heart?\n- can a child receive anything more important from a parent than to have their heart and soul known and loved by their parent?\n- can I teach my child to love God while when I'm looking at them, I'm not interested in them and I'm not loving them?\n- how long should I watch my child without saying anything? \n- how common should it be for me to watch my child, attentively, just trying to know them through their movements? \n- if I knew today was the last time that I could speak to my child, what would I say? \n- if I succeed in finding my child's heart and if I succeed in finding my child's soul, will I even know what to do with it?",
  "raw_issue": {
    "url": "https://github.com/joshualinog/scribal.bible-CONTENT-CREATION/issues/221",
    "number": 221
  }
}
