{
  "id": 231,
  "title": "What is \"The Torah of Yeshua\" ? ( Is it 1 Corinthians 10:31 ? )",
  "slug": "what-is-the-torah-of-yeshua-is-it-1-corinthians-1031",
  "author": "joshualinog",
  "createdAt": "2025-08-19T05:41:24Z",
  "updatedAt": "2025-11-07T21:13:35Z",
  "labels": [
    "isPost"
  ],
  "state": "open",
  "status": "published",
  "excerpt": "# questions - [ ] Paul references the law of Jesus christ? What is the law of Jesus Christ to paul? Can it be recovered from his writings? Is it already in front of us?       - is nomos to be read as ",
  "content": "# questions\n- [ ] Paul references the law of Jesus christ? What is the law of Jesus Christ to paul? Can it be recovered from his writings? Is it already in front of us? \n     - is nomos to be read as torah? If so, is the Torah of Yeshua supposed to be seen as on par with the Torah of moshe? Does 1 Corinthians 9 give us any insight into this?\n     - what is the relationship between the law of god, the law of Moses, the law of Jesus and the shema? What about the shema reformulated by Paul in 1st Corinthians 8.3-6?\n# passages\n- **1 Corinthians 10:31**\nSBLGNT Εἴτε οὖν ἐσθίετε εἴτε πίνετε εἴτε τι ποιεῖτε, πάντα εἰς δόξαν θεοῦ ποιεῖτε.\nYLT Whether, then, ye eat, or drink, or do anything, do all to the glory of God;\nLEB Therefore, whether you eat or you drink or whatever you do, do all things for the glory of God.\n\n### Torah passages\n- 1 Corinthians 9:9 LEB For **in the law of Moses** it is written, “You must not muzzle an ox while it is threshing.” It is not about oxen God is concerned, is it?\n- 1 Corinthians 9:20\nSBLGNT καὶ ἐγενόμην τοῖς Ἰουδαίοις ὡς Ἰουδαῖος, ἵνα Ἰουδαίους κερδήσω· τοῖς ὑπὸ νόμον ὡς ὑπὸ νόμον, ⸂μὴ ὢν αὐτὸς ὑπὸ νόμον⸃, ἵνα τοὺς ὑπὸ νόμον κερδήσω·\nYLT and I became to the Jews as a Jew, that Jews I might gain; to those under law as under law, that those under law I might gain;\nLEB I have become like a Jew to the Jews, in order that I may gain the Jews. To those under the law I became as under the law (although I myself am not under the law) in order that I may gain those under the law. 1 Corinthians 9:21\nSBLGNT τοῖς ἀνόμοις ὡς ἄνομος, μὴ ὢν ἄνομος ⸀θεοῦ ἀλλ’ ἔννομος ⸀Χριστοῦ, ἵνα ⸀κερδάνω ⸀τοὺς ἀνόμους·\nYLT to those without law, as without law--(not being without law to God, but within law to Christ) --that I might gain those without law;\nLEB To those outside the law I became as outside the law (although I am not outside the law of God, but subject to the law of Christ) in order that I may gain those outside the law.\n### shema\n- 1 Corinthians 8:3-6 LEB 3 But if anyone loves God, this one is known by him. 4 Therefore, concerning the eating of food sacrificed to idols, we know that “an idol is nothing in the world” and that “there is no God except one.” 5 For even if after all there are so-called gods, whether in heaven or on earth, just as there are many gods and many lords, 6 yet to us there is one God, the Father,  from whom are all things, and we are for him,  and there is one Lord, Jesus Christ,  through whom are all things, and we are through him.\n     - 1 Corinthians 8:3\nSBLGNT εἰ δέ τις ἀγαπᾷ τὸν θεόν, οὗτος ἔγνωσται ὑπ’ αὐτοῦ.\nYLT and if any one doth love God, this one hath been known by Him.\nLEB But if anyone loves God, this one is known by him.1 Corinthians 8:4\nSBLGNT Περὶ τῆς βρώσεως οὖν τῶν εἰδωλοθύτων οἴδαμεν ὅτι οὐδὲν εἴδωλον ἐν κόσμῳ, καὶ ὅτι οὐδεὶς ⸀θεὸς εἰ μὴ εἷς.\nYLT Concerning the eating then of the things sacrificed to idols, we have known that an idol is nothing in the world, and that there is no other God except one;\nLEB Therefore, concerning the eating of food sacrificed to idols, we know that “an idol is nothing in the world” and that “there is no God except one.”1 Corinthians 8:5\nSBLGNT καὶ γὰρ εἴπερ εἰσὶν λεγόμενοι θεοὶ εἴτε ἐν οὐρανῷ εἴτε ἐπὶ γῆς, ὥσπερ εἰσὶν θεοὶ πολλοὶ καὶ κύριοι πολλοί,\nYLT for even if there are those called gods, whether in heaven, whether upon earth--as there are gods many and lords many--\nLEB For even if after all there are so-called gods, whether in heaven or on earth, just as there are many gods and many lords,\n- כֵּיוַן דִּימְטָא קִיצָא דַּאֲבוּנָן יַעֲקב לְמִסְתַּלְקָא מִגּוֹ עַלְמָא קְרָא לִתְרֵי עֲשַר שִׁבְטַיָא בְנוֹי וְאָקִים יַתְהוֹן חֲזוֹר חֲזוֹר לְדַרְגְּשָׁא עֲנֵי אֲבוּנָן יַעֲקב וַאֲמַר לְהוֹן דִּילְמָא לְטַעֲוָותָא דְהַוֵּי תֶּרַח אָבוֹי דְאַבְרָהָם פְּלַח אַתּוּן פַּלְחִין דִּילְמָא לְטַעֲוָותָא דַּהֲוָה לָבָן אָחוּי דַאֲמָהָא פְּלַח אַתּוּן פַּלְחִין אוֹ לֵאלָהָא דְיַעֲקב אַתּוּן פַּלְחִין עַנְיַין תְּרֵי עֲשַר שִׁבְטַיָא כַּחֲדָא בְּלֵב שְׁלֵימָה וַאֲמַר שְׁמַע כְּעַן יִשְרָאֵל אֲבוּנָן יְיָ אֱלָהָנָא יְיָ חָד עָנֵי יַעֲקב וַאֲמַר יְהֵי שְׁמֵיהּ רַבָּא מְבָרֵךְ לַעֲלָם:\nWhen the end had come to our father Jakob, that he should be taken up from the world, he called the twelve tribes, his sons, and gathered them round his couch. Then Jakob our father rose up, and said to them, Do you worship any idol that Terah the father of Abraham worshipped? Do you worship any idol that Laban (the brother of his mother) worshipped? Or worship you the God of Jakob? The twelve tribes answered together, with fulness of heart, and said, Hear now, Israel our father: The Lord our God is one Lord. Jakob responded and said, May His Great Name be blessed for ever!\n\nhttps://www.sefaria.org/Targum_Jerusalem,_Deuteronomy_6.4\n- וַהֲוָה כֵּיוַן דְּמָטָא זִימְנֵיהּ דְּיַעֲקב אָבוּנָן לְמִתְכַּנְשָׁא מִגּוֹ עַלְמָא הֲוָה מִסְתְּפֵי דִלְמָא אִית בִּבְנוֹי פְּסוּלָא קָרָא יַתְהוֹן וְשַׁיְילִינוּן דִּלְמָא אִית בְּלִבְּכוֹן עַקְמָנוּתָא אָתִיבוּ כֻּלְהוֹן כַּחֲדָא וַאֲמָרוּ לֵיהּ שְׁמַע יִשְרָאֵל אָבוּנָן יְיָ אֱלָהָנָא יְיָ חָד עָנֵי יַעֲקב וַאֲמַר בְּרִיךְ שׁוּם יְקָרֵיהּ לְעָלְמֵי עַלְמִין\nIt was, when the time came that our father Jakob should be gathered out of the world, he was anxious lest there might be an idolater among his sons. He called them, and questioned them, Is there such perversity in your hearts? They answered, all of them together, and said to him: HEAR, ISRAEL OUR FATHER: THE LORD OUR GOD IS ONE LORD! Jakob made response, and said, Blessed be His Glorious Name for ever and ever.\n\nhttps://www.sefaria.org/Targum_Jonathan_on_Deuteronomy.6.4\n- אָמַר משֶׁה נְבִיָא לְעַמָּא בֵּית יִשְרָאֵל אִיזִילוּ בָּתַר פּוּלְחָנָא קְשִׁיטָא דְאַבְהַתְכוֹן וּתְרַחֲמוּן יַת יְיָ אֱלָהָכוֹן בִּתְרֵי יִצְרֵי לִבְּכוֹן וַאֲפִילוּ נְסִיב יַת נַפְשְׁכוֹן וּבְכָל מָמוֹנְכוֹן\nMosheh the prophet said to the people of the house of Israel, Follow after the true worship of your fathers, that you may love the Lord your God with each disposition of your hearts, and also that He may accept your souls, and the (dedicated) service of all your wealth;\n\nhttps://www.sefaria.org/Targum_Jonathan_on_Deuteronomy.6.5\n- וִיהוֹן פִּתְגָמַיָא הָאִלֵין דַּאֲנָא מְפַקֵיד יַתְכוֹן יוֹמָא דֵין כְּתִיבִין עַל לוּחַ לִבְּכוֹן\nand let these words which I command you this day be written upon the tables of your hearts.\n\nhttps://www.sefaria.org/Targum_Jonathan_on_Deuteronomy.6.6\n\n### glory of God \n#### lxx\n- ",
  "raw_issue": {
    "url": "https://github.com/joshualinog/scribal.bible-CONTENT-CREATION/issues/231",
    "number": 231
  }
}
