{
  "id": 243,
  "title": "Sick 53.10 or weak? Does Isaiah 14:10 speak to this translation issue?",
  "slug": "sick-5310-or-weak-does-isaiah-1410-speak-to-this-translation-issue",
  "author": "joshualinog",
  "createdAt": "2025-09-14T02:56:54Z",
  "updatedAt": "2025-11-07T21:13:53Z",
  "labels": [
    "isPost"
  ],
  "state": "open",
  "status": "published",
  "excerpt": "# the passages Isaiah 14:10 HB2 14:10 כֻּלָּם יַעֲנוּ וְיֹאמְרוּ אֵלֶיךָ גַּם־אַתָּה חֻלֵּיתָ כָמוֹנוּ אֵלֵינוּ נִמְשָׁלְתָּ: YLT All of them answer and say unto thee, Even thou hast become weak like ",
  "content": "# the passages\nIsaiah 14:10\nHB2 14:10 כֻּלָּם יַעֲנוּ וְיֹאמְרוּ אֵלֶיךָ גַּם־אַתָּה חֻלֵּיתָ כָמוֹנוּ אֵלֵינוּ נִמְשָׁלְתָּ:\nYLT All of them answer and say unto thee, Even thou hast become weak like us! Unto us thou hast become like!\nLEB All of them will respond and say to you, ‘You yourself also were made weak like us! You have become the same as us!’ \n\nIsaiah 53:10\nHB2 53:10 וַיהוָה חָפֵץ דַּכְּאוֹ הֶחֱלִי אִם־תֻּשַׂם אָשָׁם נַפְשׁוֹ יִרְאֶה זֶרַע יַאֲרִיךְ יָמִים וְחֵפֶץ יְהוָה בְּיָדוֹ יִצְלָח:\nYLT And Jehovah hath delighted to bruise him, He hath made him sick, If his soul doth make an offering for guilt, He seeth seed--he prolongeth days, And the pleasure of Jehovah in his hand doth prosper.\nLEB Yet Yahweh was pleased to crush him; he made him sick. If she places his life a guilt offering, he will see offspring. He will prolong days, and the will of Yahweh will succeed in his hand.\n\n\nוַיהוָ֞ה חָפֵ֤ץ דַּכָּאוֹ הֶחֱלִים אֶת־שָׂם אָשָׁם֙ נַפְשׁ֔וֹ יִרְאֶ֥ה זֶ֖רַע יַאֲרִ֣יךְ יָמִ֑ים וְחֵ֥פֶץ יְהוָ֖ה בְּיָד֥וֹ יִצְלָֽח׃\nEnglish translation\n\n\n\n\n\n\nAnd Yahweh was pleased/delighted in his crushed one. He healed the one that placed his own life (and soul) as an asham. He will see his seed. Yahweh will lengthen [his] days. The will of Yahweh will succeed in the hands of him, the servant.",
  "raw_issue": {
    "url": "https://github.com/joshualinog/scribal.bible-CONTENT-CREATION/issues/243",
    "number": 243
  }
}
