{
  "id": 241,
  "title": "House of name aimed conversation, at the mind up the staircase, starting low aiming high",
  "slug": "house-of-name-aimed-conversation-at-the-mind-up-the-staircase-starting-low-aiming-high",
  "author": "joshualinog",
  "createdAt": "2025-09-13T17:57:49Z",
  "updatedAt": "2025-11-07T21:13:50Z",
  "labels": [
    "➵𖦏TORAH - practicing  dry runs drills Playbook",
    "isPost"
  ],
  "state": "open",
  "status": "published",
  "excerpt": "# the practice",
  "content": "# the practice\n\n## components or elements of the practice\n- [ ] engaging the mind: meshalim for mind engagement ( Hebrew word for proverb is the same word for parable. It is a governing or likeness or a likening)\n     - [ ] a mashal of King Solomon son of David \n     - [ ] hey Mashal of King Yeshua son of David \n     - [ ] one of the 613 mitzvot in the rambam's list\n     - [ ] a parable of our own or someone else's \n     - [ ] circa Aesop's fable \n     - [ ] use a MOVIE you've watched as a parable / likeness for enlightening / an instructing /talking about movies we have already seen as parables or vehicles for instructing\n     - [ ] use a TV SHOW you've watched as a parable / likeness for enlightening / an instructing / talking about TV shows we have already seen as parables or vehicles for instruction\n     - [ ] use a BOOK you've read as a parable / likeness for enlightening / an instructing\n- [ ] when you are aiming at the mind with a parable try to aim and talk about the special job of each part of L6 or the special job of just one person in L6\n- [ ] engaging the heart: words of affection, identity statements, saying I want to be deeply known by you, I want to deeply know you. I want to be known by you  MORE, I want to know you MORE. I didn't know you like I want to know you. I don't know you as deeply as I want to know. You don't know me as deeply as I want to be known by you. Embolden others to be tanks in embracing their gospel seed identity\n- [ ] engaging the gut: satisfaction to entertainment / sport/merriment to beauty \n- [ ] engaging the members: eye contact/aimed at the other, ears stretched to the othertouching in affection, high fives, auditory: exclamation of excitement at the other yelling yes, awesome, Amen, you got it!\n",
  "raw_issue": {
    "url": "https://github.com/joshualinog/scribal.bible-CONTENT-CREATION/issues/241",
    "number": 241
  }
}
