{
  "id": 255,
  "title": "Weekly Gathering Manual / Siddur",
  "slug": "weekly-gathering-manual-siddur",
  "author": "joshualinog",
  "createdAt": "2025-09-27T14:09:36Z",
  "updatedAt": "2025-12-06T17:12:20Z",
  "labels": [
    "🍞🍷 Lechem ha Panim | Eucharist | Communion",
    "House of study / searching / investigating",
    "SYNAGOGUE",
    "➵𖦏TORAH - practicing  dry runs drills Playbook",
    "🔥🕎 🔩 Shabbat",
    "🌐🔭 Torah Geography | Mapping Realia",
    "🛐🕍⛪The EARLIEST Church",
    "isPost"
  ],
  "state": "open",
  "status": "published",
  "excerpt": "# PUBLIC READING ",
  "content": "# PUBLIC READING \n\n\n\n\n\n\n# BUILDUP LAYOUT / tracking \n## WHAT (roles)\n### participants\n#### 1. Role name: PRIEST-PROPHET \n<small>[Priests / Prophets / priest-prophets (contributor participants) ]</small>. \n#### Role ACTIONS:\n1. \n#### 2. Role name: Meeters / witnesses (non-contributor participants) ἰδιώτης\n#### Role ACTIONS:\n### non-participants\n1. Non-witnesses\n## practices\n- chanting / songs for vigil: \n     - inwardly repeat and lovingly say these  chants and chant parts in a row to Yeshua, the glory. Kind of sing them as a song of love to Yeshua within you, the Spirit of Messiah that lives within you:\n     - **the word, flesh, blood chant**:\n          - THE WORD MADE ALL FLESH. THE FLESH HOLDS THE BLOOD. THE BLOOD HOLDS THE LIFE.\n          - THE WORD BECAME FLESH.\n          - THE FLESH OF THE WORD HOLDS THE BLOOD OF THE WORD. THE BLOOD OF THE WORD HOLDS THE LIFE OF THE WORD.\n     - **the OUR food and drink and life chant**:\n          - we love you Yeshua, you are our bread. We love you Yeshua, you are our wine. We love you Yeshua, you are our life\n          - we love you Yeshua, you are our flesh. We love you,  Yeshua you are our blood. We love you Yeshua, you are our Spirit.\n          - we love you Yeshua, you our flesh that gives us our bread. We love you Yeshua, you are our blood that gives us our wine. We love you Yeshua, you are our Spirit, that gives us our life.\n\n## WHERE (places)\n###  gathering circle\n### overflow\n\n## SUPPORTING PASSAGES \n\n- Deuteronomy 31:12-13 LEB 12 Assemble the people, the men and the women and the little children and your aliens that are in your towns, so that they may hear and so that they may learn and they may revere Yahweh your God, and they shall diligently observe all the words of this law. 13 And then their children, who have not known, they too may hear, and they may learn to revere Yahweh their God all the days that you live on the land that you are crossing the Jordan to get there to take possession of it.”\n- Isaiah 6:1-4 LEB 1 In the year of the death of Uzziah the king, I saw the Lord sitting on a high and raised throne, and the hem of his robe was filling the temple. 2 Seraphs were standing above him. Each had six wings: with two he covered his face, and with two he covered his feet, and with two he flew. 3 And the one called to the other and said,  “Holy, holy, holy is Yahweh of **hosts** ARMIES!  The whole earth is full of his glory.” 4 And the pivots of the thresholds shook from the sound of those who called, and the house was filled with smoke.\n- 1 Corinthians 14:40 LEB But let all things be done decently and according to proper procedure.\n- Numbers 1:18-20 LEB 18 and they summoned the entire community on the first day of the second month. And they registered themselves among their clans according to their families, according to the number of names from those twenty years old and above individually, 19 just as Yahweh commanded Moses. And he counted them in the desert of Sinai. 20 The descendants of Reuben, the firstborn of Israel, their genealogies according to their clans, according to their families, according to the number of names, every male individually from twenty years old and above, everyone who is able to go to war:\n- 1 Corinthians 11:10 LEB Because of this, the woman ought to have a symbol of authority on her head, on account of the angels.\n     - scope of inclusion: inclusion of insiders & outsiders / inclusion of genders male and female / inclusion of ages down to small children (טף )  [who can walk and be instructed {as witnesses} and learners of the Torah ]\n- create a gathering order (and environment) that facilitates, causes/executes/performs [auditorially] hearing [ obeying ] the Torah [ that is read out loud]\n- create a gathering order (and environment) that facilitates, causes/executes/performs KNOWING [ intimately joining oneself] to [ the written and heard ] Torah [being read and explained]\n- \n\n### judgements / directives \n- [ ] the point of the contribution circle for contributing participants is maintaining a vigil of love and causing that love to manifest and build up the body that is presently circled \n- [ ] the only contributing participant that isn't maintaining a vigil of Love at a given point, and this still could be aimed for, is the contributing participant who is training a witness participant. \n- [ ] if you are not keeping the vigil there is no point in you being a part of the contributing circle.\n- [ ] no one should be made to come to the conclusion or to feel that they have to BOTH perform their duty as a contributing participant keeping vigil AND nursing and caring for non-witnesses because of Shadow/reflection duty at the same time. \n- [ ] likewise, the inverse of this, no one should come to the conclusion or be made to feel that they are in fact performing BOTH of these duties. If you are tending to and nursing and caring for non-witnesses that you have reflection duty towards, you are not ministering to intending to the substance duty of keeping vigil and contributing as an agent of heaven. You can't do both. \n- [ ] this is not an attack on either. This will speak to the necessity of making the overflow play necessarily richly diverse space of exchange. Sharpening an arrow that is a non witness is an incredible joy and a holy endeavor. We need to make this the explicit aim of parents who have non-witnesses. We need to make it open to share these goals and AIMS in the burden of them with housemates and anyone else who willingly wants to share and participate. \n- [ ] the overflow space is not arranged at a group level. It is a space that is provided for individuals to move in and out of according to their own discretion and responsibility. \n- [ ] a child that is a non-witness and cannot be trained to be a witness need not be present in the build-up circle. They should not be quarantined, silenced, cajoled, restricted as they have no share or benefit that can result from this time. It is not fair to them.",
  "raw_issue": {
    "url": "https://github.com/joshualinog/scribal.bible-CONTENT-CREATION/issues/255",
    "number": 255
  }
}
