{
  "id": 259,
  "title": "Is John chapter 1 , the prologue, describing the light and the light of the world as the chief shiner that directs mankind toward God's special meeting times? Is the apostle John depicting the word as the chief Shabbat director causing man and God to meet? Is this on purpose as a cosmological meeting time and meeting director and joiner? ",
  "slug": "is-john-chapter-1-the-prologue-describing-the-light-and-the-light-of-the-world-as-the-chief-shiner-t",
  "author": "joshualinog",
  "createdAt": "2025-09-27T19:16:18Z",
  "updatedAt": "2025-11-07T21:14:14Z",
  "labels": [
    "5️⃣ Word Five | 5",
    "6️⃣ Word Six | 6",
    "🔥🕎 🔩 Shabbat",
    "🌐🔭 Torah Geography | Mapping Realia",
    "🛡☾𖤓  TIME | breastplate חֹשֶׁן | cycles lights",
    "isPost"
  ],
  "state": "open",
  "status": "published",
  "excerpt": "",
  "content": "\n\n# Is John chapter 1 , the prologue, describing the light and the light of the world as the chief shiner that directs mankind toward God's special meeting times? Is the apostle John depicting the word as the chief Shabbat director causing man and God to meet? Is this on purpose as a cosmological meeting time and meeting director and joiner? \n\nThis could explain why John places this designation of yeshua as the light at the beginning of his gospel and in his prologue in particular. This could explain the initial demonstration of the ordered rationale of the structure of the whole gospel being sacred sabbaths and sacred meeting times honing in on Jerusalem and the temple.\n\nI have known for a long time that John's structure is calendrical or based on the sacred Sabbath calendar. I have known that John depicts yeshua's movements according to the sacred calendar and high holy days and sabbaths in connection to the Jerusalem Temple. What is new is that John may be using the title of Jesus the light as the director of the sacred times because John may be wanting us to see titling Jesus as the light as titling Jesus as the one who directs the meeting times the light in Genesis 1:14. This is why in Genesis 1 it describes the first thing being structured as the light but when the light which is structured is enumerated in verse 14 it shows that it's purpose is for the meeting times. John begins his gospel with a relaying and a retelling and reordering of Genesis 1 centered on yeshua. This could be explaining why he does that out of all the titles that yeshua may hold, John is specifically showing yeshua as the light the one who directs the meeting times vis-a-vis the meetings between man and God.\n\n## prologue passages\n\nJoh 1:4-5 YLT 4 In him was life, and the life was the light of men, 5 and the light in the darkness did shine, and the darkness did not perceive it.\n\nJoh 1:7-9 YLT 7 this one came for testimony, that he might testify about the Light, that all might believe through him; 8 that one was not the Light, but--that he might testify about the Light. 9 He was the true Light, which doth enlighten every man, coming to the world;\n\n## More John thinking on the subject from John writings \n\nJoh 12:35-36 YLT 35 Jesus, therefore, said to them, 'Yet a little time is the light with you; walk while ye have the light, that darkness may not overtake you; and he who is walking in the darkness hath not known where he goeth; 36 while ye have the light, believe in the light, that sons of light ye may become.' These things spake Jesus, and having gone away, he was hid from them,\n1Jn 1:5 LEB And this is the message which we have heard from him and announce to you, that God is light and there is no darkness in him at all.\n1Jn 1:7 LEB But if we walk in the light as he is in the light, we have fellowship with one another, and the blood of Jesus his Son cleanses us from all sin.\n\n## questions\n- [ ] does John have a more Torah Moses centered reason for employing the title The light, and applying that title to Yeshua as the messiah in particular, the promised Moses successor? \n- [ ] if so does John have a more Torah Moses centered reason for employing the title the word, and applying that title to Yeshua as the Messiah in particular, the promised Moses successor? Is this more is this more Torah centered reason for employing the title The word, actually the Torah, the law itself? Should we be thinking of the word as a slant or near synonym or an echo of the law of Moses, the Torah of God itself?\n",
  "raw_issue": {
    "url": "https://github.com/joshualinog/scribal.bible-CONTENT-CREATION/issues/259",
    "number": 259
  }
}
