{
  "id": 264,
  "title": "Devotional verse list for prayer",
  "slug": "devotional-verse-list-for-prayer",
  "author": "joshualinog",
  "createdAt": "2025-10-01T13:26:02Z",
  "updatedAt": "2025-11-07T21:14:21Z",
  "labels": [
    "isPost"
  ],
  "state": "open",
  "status": "published",
  "excerpt": "# devotional Verse List for prayer start",
  "content": "# devotional Verse List for prayer start\n\n\nDeu 6:4-5 YLT 'Hear, O Israel, Jehovah our God is one Jehovah; and thou hast loved Jehovah thy God with all thy heart, and with all thy soul, and with all thy might,\n\nPsa 27:4 LEB One thing I have asked from Yahweh; it I will seek: that I may dwell in the house of Yahweh all the days of my life, to behold the beauty of Yahweh, and to consider his temple.\n\nPsa 119:136 LEB Streams of water flow down from my eyes, because people do not heed your law.\n\nPsa 119:20 LEB My soul is crushed with longing for your ordinances at all times.\n\nIsa 26:9 LEB I desire you with all my soul in the night; also I seek you with my spirit within me, for when your judgments are upon the earth, the inhabitants of the world learn righteousness.\n\nPhi 3:7-11 LEB But whatever things were gain to me, these things I have considered loss because of Christ. More than that, I even consider all things to be loss because of the surpassing greatness of the knowledge of Christ Jesus my Lord, for the sake of whom I have suffered the loss of all things, and consider them dung, in order that I may gain Christ and may be found in him, not having my righteousness which is from the law, but which is through faith in Christ, the righteousness from God on the basis of faith, so that I may know him and the power of his resurrection and the fellowship of his sufferings, being conformed to his death, if somehow I may attain to the resurrection from the dead.\n\nMat 10:37-39 LEB The one who loves father or mother more than me is not worthy of me, and the one who loves son or daughter more than me is not worthy of me. And whoever does not take up his cross and follow me is not worthy of me. The one who finds his life will lose it, and the one who loses his life because of me will find it.\n\n1Co 8:2-3 LEB If anyone thinks he knows anything, he has not yet known as it is necessary to know. But if anyone loves God, this one is known by him.\n\n1Co 8:5-6 LEB For even if after all there are so-called gods, whether in heaven or on earth, just as there are many gods and many lords, yet to us there is one God, the Father, from whom are all things, and we are for him, and there is one Lord, Jesus Christ, through whom are all things, and we are through him.\n\n1Co 8:2-6 LEB If anyone thinks he knows anything, he has not yet known as it is necessary to know. But if anyone loves God, this one is known by him. Therefore, concerning the eating of food sacrificed to idols, we know that \"an idol is nothing in the world\" and that \"there is no God except one.\" For even if after all there are so-called gods, whether in heaven or on earth, just as there are many gods and many lords, yet to us there is one God, the Father, from whom are all things, and we are for him, and there is one Lord, Jesus Christ, through whom are all things, and we are through him.\n\nPsa 28:1-2 LEB A psalm of David. To you, O Yahweh, I call. O my rock, do not be deaf to me. Or else, if you are silent to me, then I will become like those descending to the pit. Hear the voice of my supplications when I cry to you for help, when I lift up my hands toward your holy inner sanctuary.\n\nPsa 63:1-3 LEB A psalm of David, when he was in the wilderness of Judah. O God, you are my God; I will seek you diligently. My soul thirsts for you; my flesh longs for you as in a dry and weary land without water. Thus I have seen you in the sanctuary, beholding your strength and glory. Because your loyal love is better than life, my lips will praise you.\n\nPsa 63:3 LEB Because your loyal love is better than life, my lips will praise you.\n\nPsa 101:1-2 LEB Of David. A psalm. I will sing of loyal love and justice; I will sing praises to you, O Yahweh. I will give attention to the way of integrity. When will you come to me? I will walk in the integrity of my heart in the midst of my house.\n\nMat 3:16-17 LEB Now after he was baptized, Jesus immediately went up from the water, and behold, the heavens opened and he saw the Spirit of God descending like a dove coming upon him. And behold, there was a voice from heaven saying, \"This is my beloved Son, with whom I am well pleased.\"\n\nMat 4:1-4 LEB Then Jesus was led up into the wilderness by the Spirit to be tempted by the devil, and after he had fasted forty days and forty nights, then he was hungry. And the tempter approached and said to him, \"If you are the Son of God, order that these stones become bread.\" But he answered and said, \"It is written, 'Man will not live on bread alone, but on every word that comes out of the mouth of God.\"\n\nDeu 8:1-5 LEB \"All of the commandments that I am commanding you today you must diligently observe, so that you may live and multiply, and you may go and take possession of the land that Yahweh swore to your ancestors. And you shall remember all of the way that Yahweh your God led you during these forty years in the desert in order to humble you and to test you to know what is in your heart, whether you would diligently keep his commandments or not. And he humbled you and let you go hungry, and then he fed you with that which you did not know nor did your ancestors know, in order to make you know that not by bread alone but by all that goes out of the mouth of Yahweh humankind shall live. Your clothing did not wear out on you, and your feet did not swell during these forty years. And you should know with your heart that as a man disciplines his son, so Yahweh your God is disciplining you.\n\nDeu 10:12-13 LEB And now, Israel, what is Yahweh your God asking from you, except to revere Yahweh your God, to go in all his ways and to love him and to serve Yahweh your God with all your heart and with all your soul, to keep the commandments of Yahweh and his statutes that I am commanding you today for your own good.\n\nEph 5:18-20 LEB And do not be drunk with wine (in which is dissipation), but be filled by the Spirit, speaking to one another in psalms and hymns and spiritual songs, singing and singing praise in your heart to the Lord, giving thanks always for all things in the name of our Lord Jesus Christ to the God and Father,\n\nJos 1:6-9 LEB Be strong and courageous, for you will give the people this land as an inheritance that I swore to their ancestors to give them. Only be strong and very courageous to observe diligently the whole law that Moses my servant commanded you. Do not turn aside from it, to the right or left, so that you may succeed wherever you go. The scroll of this law will not depart from your mouth; you will meditate on it day and night so that you may observe diligently all that is written in it. For then you will succeed in your ways and prosper. Did I not command you? Be strong and courageous! Do not fear or be dismayed, for Yahweh your God is with you wherever you go.\"\n\n- Sent from MySword",
  "raw_issue": {
    "url": "https://github.com/joshualinog/scribal.bible-CONTENT-CREATION/issues/264",
    "number": 264
  }
}
