{
  "id": 273,
  "title": "Courtship Marriage Questions",
  "slug": "courtship-marriage-questions",
  "author": "joshualinog",
  "createdAt": "2025-10-05T18:27:10Z",
  "updatedAt": "2025-11-07T21:14:37Z",
  "labels": [
    "isPost"
  ],
  "state": "open",
  "status": "published",
  "excerpt": "# Courtship Marriage Questions ## S1 Earth  ### S101 WATER  - [ ] How do you want to source water? Do you want it well? Do you want to use city water? Filtration?  - [ ] How do you envision preparing ",
  "content": "# Courtship Marriage Questions\n## S1 Earth \n### S101 WATER \n- [ ] How do you want to source water? Do you want it well? Do you want to use city water? Filtration? \n- [ ] How do you envision preparing food? Each of you taking turns? Both of you cooking together? Will kids be involved?\n- [ ]  Do you see this as a woman's duty?\n- [ ] Who is primarily going to do grocery shopping? How do you want to source your food? How important is this to you?\n- [ ] What are your plans for diet and nutritional needs?\n- [ ] Do you want to grow your own food? \n- [ ] Think of two poles: one pole is frugality and saving money, the other pole is preferred food goals. Which bowl is more important to you and why? \n- [ ] To what degree do you want to be off-grid in regards to food and water? This is like asking how much reliance are you comfortable with in relying on governmental and city structures and services for water and food?\n- [ ] How frequently do you want to eat and drink? How many meals? Snacks?\n- [ ]  What about meal routines for children? \n- [ ] What kind of portions do you eat at various meals? \n- [ ] Do you want to eat sit down meals at every meal? Only one meal? Only two? \n- [ ] What kind of budget do you want to allot for water and food?\n### S102 CLOTHING\n- [ ] Do you want your wife to wear a head covering?\n- [ ] How important is clothing and fashion to you? \n- [ ] Are you comfortable wearing hand-me-down or thrift clothing?\n- [ ] What kind of budget do you want to allot for clothing? \n### S103 TENT HOUSING\n\n- [ ] What kind of housing is completely off limits and unsuitable to you?\n- [ ] How important is the aesthetics and the aesthetical appearance of your house?\n\n### S104 LAND\n### S105 PRODUCE & INCOME\n### S106 TOOLS\n### S107 STORED WEALTH\n### S201 LOST / COMMUNITY\n### S202 KIN W/DUTY | RELATIVES\n- [ ] In what way do you want your spouse to honor your mother? Your father? What kind of actions and behaviors do you hope to see your spouse perform towards your parents?\n- [ ] How frequently do you hope to see your parents?\n- [ ]  How frequently do you want your spouse to see your parents? Do you plan on trying to maintain hanging out with your parents separate from your spouse?\n- [ ] What kind of duties do you want your parents perform for your marriage?\n- [ ] What kind of duties do you anticipate or foresee your parents performing for your house of name? What kind of activities do you see them doing together? Doing with Their grandchildren and your children?\n- [ ] What is the meaningful time spent interfacing with relatives look like to you?\n\n### S203 Those being called/ Temple / onboarding & intersections\n### S204 SYNAGOGUE / Household of Households\n### S205 HOUSEHOLD\n### S206 HOUSE OF NAME\n### S207 MARRIAGE\n- [ ] What is your definition of sex?\n- [ ] How frequently do you think you and your spouse should have sex?\n- [ ] What does a healthy sex life look like?\n- [ ] Describe the role and importance of physical affection and physical contact being shown to your spouse.\n\n## S3 MEMBERS\n- [ ] How important is exercise to you?\n- [ ]  How frequently do you exercise? \n- [ ] Do you plan on exercising together? Do you want it to be a family activity or do you prefer to exercise alone? \n## S4 GUT\n- [ ] How important is play in your life?\n- [ ] What kind of games do you play?\n- [ ] Will you play games as a family? What sort of games?\n- [ ] Describe the inclusion of screens in your life. \n- [ ] How often do you want you and your spouse to interface with screens? How often do you want your house of name to interface with screens? How often do you want your children to interface with screens?\n- [ ] How frequently do you plan to play with your children?\n- [ ] How important is Beauty in your life?\n- [ ] Describe how you plan to put beautiful things, beautiful stories, and beauty in front of your own eyes regularly\n- [ ] Describe how you plan to put beautiful things and beauty in front of the eyes of your spouse and your children regularly.",
  "raw_issue": {
    "url": "https://github.com/joshualinog/scribal.bible-CONTENT-CREATION/issues/273",
    "number": 273
  }
}
