{
  "id": 294,
  "title": "why do Christians depict God's end game / final plan as an escape mission instead of an invasion?",
  "slug": "why-do-christians-depict-gods-end-game-final-plan-as-an-escape-mission-instead-of-an-invasion",
  "author": "joshualinog",
  "createdAt": "2025-10-28T20:03:32Z",
  "updatedAt": "2025-11-07T21:15:05Z",
  "labels": [
    "EXILE | גלות | σχῆμα τοῦ κόσμου",
    "Eschatology | the last times | the end times",
    "H&E TwofoldYahweh | Cosmological Binitarian Yahweh",
    "Glory Name Face OF YAH / Visible | Earthly YAH",
    "isPost"
  ],
  "state": "open",
  "status": "published",
  "excerpt": "# why do Christians depict God's end game / final plan as an escape mission instead of an invasion? - I heard someone say this is not my home. I will be called home when I die.",
  "content": "# why do Christians depict God's end game / final plan as an escape mission instead of an invasion?\n- I heard someone say this is not my home. I will be called home when I die.\n\nI understand the sentiment, especially because the current configuration of the age and World Order is not our home. it is the evil age, the world, scheme overseen by the god of the age, the exile. but that is an ontological state of creation.\n\nthe scriptures depict God returning and allowing Satan in the Coalition of gods to inherit nothing. everything they have will be stripped of them and they themselves will die like men. God promises an invasion followed by a reclamation.\n\nconsider a parable: imagine creation as a daughter of God. imagine this daughter is kidnapped, dressed as a prostitute, pimped out by an oppressor, and living the life of a prostitute. if God seeks to \"escape\" this situation he is not good. at the same time you can see that creation dressed as a prostitute, living a life of a prostitute is not our home either. God's solution to this is to return, invade, destroy and bring to ultimate ruination The Pimps and oppressors, destroy the prostitute garb of his daughter and give her the Robes of daughterhood.  this is what God will do to creation. this is his end game. we are called to long for this end game, perpetuate it's arrival, and participate in the invasion, the battling, the war, and the reclamation, and reconstitution of creation. ",
  "raw_issue": {
    "url": "https://github.com/joshualinog/scribal.bible-CONTENT-CREATION/issues/294",
    "number": 294
  }
}
