{
  "id": 293,
  "title": "Are the 10 plagues and pharonic dialogues purposefully functioning as negative Omens Within the Egyptian religious paradigm?",
  "slug": "are-the-10-plagues-and-pharonic-dialogues-purposefully-functioning-as-negative-omens-within-the-egyp",
  "author": "joshualinog",
  "createdAt": "2025-10-28T17:15:25Z",
  "updatedAt": "2025-11-07T21:15:04Z",
  "labels": [
    "🏹➵𖦏📜 TORAH",
    "why the Bible?",
    "Bible-in-bits | Bible in Bits",
    "what is the bible?",
    "Bible problems | problems with the Bible",
    "the Bible as a tool",
    "boring Bible alien god",
    "Bible study",
    "isPost"
  ],
  "state": "open",
  "status": "published",
  "excerpt": "# Are the 10 plagues and pharonic dialogues purposefully functioning as negative Omens Within the Egyptian religious paradigm?",
  "content": "# Are the 10 plagues and pharonic dialogues purposefully functioning as negative Omens Within the Egyptian religious paradigm?\n\nDoes the Torah depict the 10 plagues & back & forth between Pharaoh on the one hand & Moshe, Aaron (angels) / Yahweh on the other PARTLY as oracular imprecations (negative omens) related to eternality/death punishment within the cultural paradigm of contemporaneous Egyptian religion? Specifically about Ma'at weighing the heart of the deceased, including Pharaoh. Ma'at would weigh the heart of the deceased against the feather of Ma'at. If lighter or equal, tung enter into joyful afterlife. If the heart is heavy, they are devoured by Ammit. Trying to avoid being devoured by Ammit would be an incredible irony if you consider the following Pharonic command :\n\nExodus 1:22 LEB And Pharaoh commanded all his people, saying, “Every son who is born you will throw into the Nile, and every daughter you will let live.”\n\nAmmit is a demon, lesser deity that is only feared: she is a chimera with a crocodile head, lion parts, and a hippo hindquarter : all apex predators associated with the Nile. If your heart is heavy, i.e. evil, Ammit will be dispatched to devour the heart, thus condemning that person to Duat, annihilating them and preventing entry to the after life.\n\n- circa Walton's sun & moon omen explanation for Yehoshua & the sun standing still?\n\n## ancient sources\n\n\"42 Negative Confessions (Papyrus of Ani)\nedit\nThe negative confessions one would make after death could be individualized, that is, vary from person to person. These were the confessions found in the Papyrus of Ani:[62]\n\nHail, Usekh-nemmt, who comest forth from Anu, I have not committed sin.\nHail, Hept-khet, who comest forth from Kher-aha, I have not committed robbery with violence.\nHail, Fenti, who comest forth from Khemenu, I have not stolen.\nHail, Am-khaibit, who comest forth from Qernet, I have not slain men and women.\nHail, Neha-her, who comest forth from Rasta, I have not stolen grain.\nHail, Ruruti, who comest forth from Heaven, I have not purloined offerings.\nHail, Arfi-em-khet, who comest forth from Suat, I have not stolen the property of God.\nHail, Neba, who comest and goest, I have not uttered lies.\nHail, Set-qesu, who comest forth from Hensu, I have not carried away food.\nHail, Utu-nesert, who comest forth from Het-ka-Ptah, I have not uttered curses.\nHail, Qerrti, who comest forth from Amentet, I have not committed adultery.\nHail, Hraf-haf, who comest forth from thy cavern, I have made none to weep.\nHail, Basti, who comest forth from Bast, I have not eaten the heart.\nHail, Ta-retiu, who comest forth from the night, I have not attacked any man.\nHail, Unem-snef, who comest forth from the execution chamber, I am not a man of deceit.\nHail, Unem-besek, who comest forth from Mabit, I have not stolen cultivated land.\nHail, Neb-Maat, who comest forth from Maati, I have not been an eavesdropper.\nHail, Tenemiu, who comest forth from Bast, I have not slandered anyone.\nHail, Sertiu, who comest forth from Anu, I have not been angry without just cause.\nHail, Tutu, who comest forth from Ati, I have not debauched the wife of any man.\nHail, Uamenti, who comest forth from the Khebt chamber, I have not debauched the wives of other men.\nHail, Maa-antuf, who comest forth from Per-Menu, I have not polluted myself.\nHail, Her-uru, who comest forth from Nehatu, I have terrorized none.\nHail, Khemiu, who comest forth from Kaui, I have not transgressed the law.\nHail, Shet-kheru, who comest forth from Urit, I have not been angry.\nHail, Nekhenu, who comest forth from Heqat, I have not shut my ears to the words of truth.\nHail, Kenemti, who comest forth from Kenmet, I have not blasphemed.\nHail, An-hetep-f, who comest forth from Sau, I am not a man of violence.\nHail, Sera-kheru, who comest forth from Unaset, I have not been a stirrer up of strife.\nHail, Neb-heru, who comest forth from Netchfet, I have not acted with undue haste.\nHail, Sekhriu, who comest forth from Uten, I have not pried into other's matters.\nHail, Neb-abui, who comest forth from Sauti, I have not multiplied my words in speaking.\nHail, Nefer-Tem, who comest forth from Het-ka-Ptah, I have wronged none, I have done no evil.\nHail, Tem-Sepu, who comest forth from Tetu, I have not worked witchcraft against the king.\nHail, Ari-em-ab-f, who comest forth from Tebu, I have never stopped the flow of water of a neighbor.\nHail, Ahi, who comest forth from Nu, I have never raised my voice.\nHail, Uatch-rekhit, who comest forth from Sau, I have not cursed God.\nHail, Neheb-ka, who comest forth from thy cavern, I have not acted with arrogance.\nHail, Neheb-nefert, who comest forth from thy cavern, I have not stolen the bread of the gods.\nHail, Tcheser-tep, who comest forth from the shrine, I have not carried away the khenfu cakes from the spirits of the dead.\nHail, An-af, who comest forth from Maati, I have not snatched away the bread of the child, nor treated with contempt the god of my city.\nHail, Hetch-abhu, who comest forth from Ta-she, I have not slain the cattle belonging to the god.\"\n https://en.wikipedia.org/wiki/Maat#:~:text=42%20Negative%20Confessions%20(,belonging%20to%20the%20god.",
  "raw_issue": {
    "url": "https://github.com/joshualinog/scribal.bible-CONTENT-CREATION/issues/293",
    "number": 293
  }
}
