{
  "id": 300,
  "title": "What do you do when someone has confessed they sinned against you but they have not repented?",
  "slug": "what-do-you-do-when-someone-has-confessed-they-sinned-against-you-but-they-have-not-repented",
  "author": "joshualinog",
  "createdAt": "2025-11-13T11:15:44Z",
  "updatedAt": "2025-11-13T19:02:23Z",
  "labels": [
    "🦍 \"🅸\" - Instructor | APESI",
    "In and out : identity and the people of God",
    "isPost"
  ],
  "state": "open",
  "status": "published",
  "excerpt": "First, you FORGIVE them!  As an aside, Even if they hate me and keep sinning & never confess their sins, I still forgive them. I was trained by my rabbi, the Messiah to order all my prayers with these",
  "content": "First, you FORGIVE them!  As an aside, Even if they hate me and keep sinning & never confess their sins, I still forgive them. I was trained by my rabbi, the Messiah to order all my prayers with these words : forgive me of my sins ONLY as I forgive those who sin against me.\n\nBut what then? What do you do after forgiving them?what do you do next?\n\nYou should help them to choose to repent.\n\nA note on the word repent is helpful. The english word repent didn't exist in Yeshua's day, because English didn't exist. (Got 'em :P) The word actually means RETURN. Our Teacher Yeshua went from village to village yelling RETURN, the Kingdom of heaven is here.\n\nreturn to God, go back to his house, go back to his people. here it is helpful to use a synonym of return, rejoin (also not in existence :P). Rejoin God, rejoin his people. \n\nThis is a call to choose, and a call to choose participation. \n\n\n\n## unformed thoughts\n- Turning the other cheek DOES NOT mean \n- he has opened up and confessed how be harmed, but he has done NOTHING to heal ; he has broken, but done nothing to fixit. he hasn't rebuilt what he broke, or rejoined in the building process.\n- have nothing to do with darkness but rather even expose it....\n\n\n\n",
  "raw_issue": {
    "url": "https://github.com/joshualinog/scribal.bible-CONTENT-CREATION/issues/300",
    "number": 300
  }
}
